test/src/test/testtool/SoapValidator/HappyFlow/api-in.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<HelloWorld_Request xmlns="http://api.nn.nl/HelloWorld">
			<Text>hello_to_all</Text>
		</HelloWorld_Request>
	</soapenv:Body>
</soapenv:Envelope>
